# DBeam_SetTShutAngle

```pascal
PROCEDURE DBeam_SetTShutAngle(angle : REAL);
```

```python
def vs.DBeam_SetTShutAngle(angle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|angle|REAL|   |

## Examples
```pascal
DBeam_SetTShutAngle(1.0);
```
```python
import vs

angle = 45.0

vs.DBeam_SetTShutAngle(angle)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight